/*
 Navicat MySQL Data Transfer

 Source Server         : entranet
 Source Server Type    : MySQL
 Source Server Version : 100136
 Source Host           : localhost:3306
 Source Schema         : entranet

 Target Server Type    : MySQL
 Target Server Version : 100136
 File Encoding         : 65001

 Date: 06/11/2018 16:03:20
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for knowledge
-- ----------------------------
DROP TABLE IF EXISTS `knowledge`;
CREATE TABLE `knowledge`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(400) CHARACTER SET utf8 COLLATE utf8_thai_520_w2 NULL DEFAULT NULL,
  `knowledge` text CHARACTER SET utf8 COLLATE utf8_thai_520_w2 NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 9 CHARACTER SET = utf8 COLLATE = utf8_thai_520_w2 ROW_FORMAT = Compact;

-- ----------------------------
-- Records of knowledge
-- ----------------------------
INSERT INTO `knowledge` VALUES (1, 'ทดสอบระบบค้นหาโรงพยาบาลไชยปราการ', 'แนะนำข้อมูลโรงพยาบาล ประวัติความเป็นมาและพัฒนาการ โครงสร้างองค์กร วิสัยทัศน์ พันธกิจ  	วิสัยทัศน์ (vision) โรงพยาบาลชุมชนที่มีคุณภาพด้านบริการมุ่งส่งเสริมสุขภาพชุมชน 	พัมธกิจ (mission) พัฒนาระบบบริการปฐมภูมิและทุติยภูมิตามมาตรฐานการบริหารจัดการที่มีประสิท');
INSERT INTO `knowledge` VALUES (2, 'ลองทดสอบใน text', 'อธิบายวัตถุประสงค์ ความเป็นมาของการเริ่มพัฒนาคุณภาพระบบเทคโนโลยีสารสนเทศของโรงพยาบาล 		แผนกเทคโนโลยีสารสนเทศโรงพยาบาลไชยปราการ ก่อตั้งขึ้นในปี 2536 เป็นหน่วยงานหนึ่งในกลุ่มงานยุทธศาสตร์และสารสนเทศทางการแพทย์ เพื่อให้การบริหารจัดการระบบคอมพิวเตอร์และเครือข่ายสารสนเทศเป็นไปด้วยความรวดเร็วและมีประสิทธิภาพ  ในขณะเริ่มก่อตั้ง ระบบสารสนเทศโรงพยาบาลไชยปราการยังเป็นระบบที่ยังผูกขาดกับทางบริษัทเอกชนไม่สามารถแก้ไขหรือเพิ่มเติมในส่วนขาดด้วยตัวเองได้ จนมาถึงปี 2557 งานเทคโนโลยีสารสนเทศได้มีการพัฒนาระบบที่สามารถทำงานตามความต้องการและตอบสนองผู้รับบริการ ตรงตามความต้องการของโรงพยาบาลมากที่สุด 	ในปัจจุบัน งานเทคโนโลยีสารสนเทศได้มีการวางแผนและออกแบบระบบ ให้เหมาะสมกับความต้องการของผู้ใช้ มีการจัดตั้งคณะกรรมการพัฒนาระบบสารสนเทศ เพื่อให้มีส่วนร่วมในการออกแบบระบบ เชื่อมโยงสารสนเทศในโรงพยาบาลให้สามารถใช้ข้อมูลร่วมกัน และการกระจายข้อมูลสารสนเทศอย่างมีประสิทธิภาพ มีการพัฒนาซอฟท์แวร์เพื่อใช้งานภายในโรงพยาบาล รับผิดชอบดูแลระบบเครือข่ายคอมพิวเตอร์ การดูแลบำรุงรักษาระบบ การซ่อมบำรุงระบบคอมพิวเตอร์ การบริหารจัดการระบบข้อมูล รวมทั้งการฝึกสอนเจ้าหน้าที่ภายในและภายนอก โรงพยาบาล');
INSERT INTO `knowledge` VALUES (3, 'แผนแม่บทเทคโนโลยีสารสนเทศs', 'คำอธิบาย : หมายถึงแผนที่จัดทำเป็นลายลักษณ์อักษร มีเลขหน้ากำกับ ประกอบด้วยวิสัยทัศน์ พันธกิจ ยุทธศาสตร์ของโรงพยาบาล ต่อด้วยการวิเคราะห์ปัจจัยที่ส่งผลต่อความสำเร็จตามเป้าประสงค์และเข็มมุ่งของยุทธศาสตร์โรงพยาบาล ถอดออกมาเป็นแผนแม่บทเทคโนโลยีสารสนเทศ ที่แยกออกเป็นยุทธศาสตร์เทคโนโลยีสารสนเทศที่ตอบสนองต่อยุทธศาสตร์ของโรงพยาบาลทุกด้าน และแผนปฏิบัติการที่กำหนดระยะเวลาที่จะดำเนินการตามแผนในช่วง 3-5 ปี');
INSERT INTO `knowledge` VALUES (4, 'การจัดการความเสี่ยงในระบบเทคโนโลยีสารสนเทศ', 'คำอธิบาย : ระบบการจัดการความเสี่ยงที่เริ่มจากการประเมินความเสี่ยงทุกด้านที่จะเกิดขึ้นต่อระบบเทคโนโลยีสารสนเทศโรงพยาบาล ให้คะแนนความเสี่ยงและจัดลำดับความสำคัญ จัดทำแผนการจัดการความเสี่ยงเป็นลายลักษณ์อักษร มีเลขหน้ากำกับ ประกอบด้วยผลการประเมินความเสี่ยง ยุทธศาสตร์การจัดการความเสี่ยงและแผนปฏิบัติการที่กำหนดระยะเวลาที่จะดำเนินการตามแผนในช่วง 1 ปี เมื่อจบการดำเนินการตามแผนต้องมีการประเมินผลการดำเนินงานและนำผลการประเมินมาปรับปรุงเป็นแผนในรอบปีต่อไป รวมทั้งการจัดการความเสี่ยงที่จะเกิดขึ้นกับผู้ป่วย จากการใช้เทคโนโลยีสารสนเทศด้วย');
INSERT INTO `knowledge` VALUES (5, 'สำนักงานปลัดกระทรวงสาธารณสุขและสมาคมเวชสารสนเทศไทย', 'แนะนำข้อมูลโรงพยาบาล ประวัติความเป็นมาและพัฒนาการ โครงสร้างองค์กร วิสัยทัศน์ พันธกิจ  	วิสัยทัศน์ (vision) โรงพยาบาลชุมชนที่มีคุณภาพด้านบริการมุ่งส่งเสริมสุขภาพชุมชน 	พัมธกิจ (mission) พัฒนาระบบบริการปฐมภูมิและทุติยภูมิตามมาตรฐานการบริหารจัดการที่มีประสิท');
INSERT INTO `knowledge` VALUES (6, 'อธิบายวัตถุประสงค์', 'อธิบายวัตถุประสงค์ ความเป็นมาของการเริ่มพัฒนาคุณภาพระบบเทคโนโลยีสารสนเทศของโรงพยาบาล 		แผนกเทคโนโลยีสารสนเทศโรงพยาบาลไชยปราการ ก่อตั้งขึ้นในปี 2536 เป็นหน่วยงานหนึ่งในกลุ่มงานยุทธศาสตร์และสารสนเทศทางการแพทย์ เพื่อให้การบริหารจัดการระบบคอมพิวเตอร์และเครือข่ายสารสนเทศเป็นไปด้วยความรวดเร็วและมีประสิทธิภาพ  ในขณะเริ่มก่อตั้ง ระบบสารสนเทศโรงพยาบาลไชยปราการยังเป็นระบบที่ยังผูกขาดกับทางบริษัทเอกชนไม่สามารถแก้ไขหรือเพิ่มเติมในส่วนขาดด้วยตัวเองได้ จนมาถึงปี 2557 งานเทคโนโลยีสารสนเทศได้มีการพัฒนาระบบที่สามารถทำงานตามความต้องการและตอบสนองผู้รับบริการ ตรงตามความต้องการของโรงพยาบาลมากที่สุด 	ในปัจจุบัน งานเทคโนโลยีสารสนเทศได้มีการวางแผนและออกแบบระบบ ให้เหมาะสมกับความต้องการของผู้ใช้ มีการจัดตั้งคณะกรรมการพัฒนาระบบสารสนเทศ เพื่อให้มีส่วนร่วมในการออกแบบระบบ เชื่อมโยงสารสนเทศในโรงพยาบาลให้สามารถใช้ข้อมูลร่วมกัน และการกระจายข้อมูลสารสนเทศอย่างมีประสิทธิภาพ มีการพัฒนาซอฟท์แวร์เพื่อใช้งานภายในโรงพยาบาล รับผิดชอบดูแลระบบเครือข่ายคอมพิวเตอร์ การดูแลบำรุงรักษาระบบ การซ่อมบำรุงระบบคอมพิวเตอร์ การบริหารจัดการระบบข้อมูล รวมทั้งการฝึกสอนเจ้าหน้าที่ภายในและภายนอก โรงพยาบาล โดยดำเนินการดังนี้ •	สำรวจความต้องการใช้ข้อมูลสารสนเทศแก่เจ้าหน้าที่ทุกระดับในโรงพยาบาล •	วางแผนการตอบสนองความต้องการข้อมูลสารสนเทศของหน่วยงานในโรงพยาบาล ทุก หน่วยงานมีระบบสารสนเทศของตนเอง ทั้งในรูปแบบแฟ้มเอกสาร และฐานข้อมูลอิเลคทรอนิกส์ เพื่อการบริหารที่มีมาตรฐาน ถูกต้อง ทันเวลาเข้าถึงได้ง่าย และเชื่อมโยงกันได้ทุกหน่วยงาน •	สนับสนุนระบบสารสนเทศเพื่อให้ผู้รับบริการ โดยนำคอมพิวเตอร์ระบบเครือข่ายมาใช้ในการบริการตรวจ รักษา และบันทึกข้อมูลผู้รับบริการ เพื่อ ลดปริมาณการใช้กระดาษ และความสะดวก รวดเร็วในการเรียกใช้และประมวลผลข้อมูล •	จัดทำระบบฐานข้อมูลผู้รับบริการทั้งหมด เชื่อมโยงไปทุกหน่วยงานในโรงพยาบาลมี โปรแกรมประมวลผลรายงานเพื่อส่งหน่วยงานต้นสังกัดและการประมวลผลข้อมูลเชิงคุณภากระจายทุกฝ่าย/งานที่เกี่ยวข้องกับการดูแลผู้ป่วย เพื่อสะดวกในการเรียกใช้ข้อมูล •	ศูนย์ข้อมูลข่าวสารเป็นหน่วยงานกลางในการประสานงาน และตอบสนองข้อมูลข่าวสารตามที่ฝ่าย/งานต่าง ๆ ร้องขอที่นอกเหนือจากการรายงานข้อมูลปกติ •	สนับสนุนระบบคอมพิวเตอร์ของโรงพยาบาล ทั้งด้าน Hardware Infrastructure และ Software 0.3 อธิบายโครงสร้างและหน้าที่ของคณะกรรมการหรือกลุ่มบุคคลที่รับผิดชอบการพัฒนาคุณภาพระบบเทคโนโลยีสารสนเทศของโรงพยาบาลในปัจจุบัน');
INSERT INTO `knowledge` VALUES (7, 'test', '0.1 แนะนำข้อมูลโรงพยาบาล ประวัติความเป็นมาและพัฒนาการ โครงสร้างองค์กร วิสัยทัศน์ พันธกิจ  	วิสัยทัศน์ (vision) โรงพยาบาลชุมชนที่มีคุณภาพด้านบริการมุ่งส่งเสริมสุขภาพชุมชน 	พัมธกิจ (mission) พัฒนาระบบบริการปฐมภูมิและทุติยภูมิตามมาตรฐานการบริหารจัดการที่มีประสิทธิภาพ ชุมชนเข้าถึงบริการ ครอบคลุมทั้ง 4 มิติโดยการมีส่วนร่วมของชุมชนอย่าต่อเนื่องและยั่งยืน 	คำขวัญ (slogan) วาจาอ่อนหวาน บริการด้วยจิตทุกชีวิตเหมือนญาติ  เป้าหมายหลัก 1. ด้านสนับสนุนการดูแลผู้รับบริการของโรงพยาบาล ให้มีการจัดเก็บข้อมูลการรักษาอย่างต่อเนื่องบน อุปกรณ์ Server ระบบคอมพิวเตอร์ รวมถึงงระบบเครือข่ายและอินเตอร์เน็ตอย่างทั่วถึง 2. ด้านพัฒนาคุณภาพ จัดเก็บข้อมูลบุคลากร, สถิติโรค, รายงานโรคตามความต้องการขอผู้รับบริการ 3. ด้านการศึกษาวิจัย โดยการสนับสนุนข้อมูลสารสนเทศทั้งหน่วยงานภายในและภายนอกองค์กร  0.2 อธิบายวัตถุประสงค์ ความเป็นมาของการเริ่มพัฒนาคุณภาพระบบเทคโนโลยีสารสนเทศของโรงพยาบาล 		แผนกเทคโนโลยีสารสนเทศโรงพยาบาลไชยปราการ ก่อตั้งขึ้นในปี 2536 เป็นหน่วยงานหนึ่งในกลุ่มงานยุทธศาสตร์และสารสนเทศทางการแพทย์ เพื่อให้การบริหารจัดการระบบคอมพิวเตอร์และเครือข่ายสารสนเทศเป็นไปด้วยความรวดเร็วและมีประสิทธิภาพ  ในขณะเริ่มก่อตั้ง ระบบสารสนเทศโรงพยาบาลไชยปราการยังเป็นระบบที่ยังผูกขาดกับทางบริษัทเอกชนไม่สามารถแก้ไขหรือเพิ่มเติมในส่วนขาดด้วยตัวเองได้ จนมาถึงปี 2557 งานเทคโนโลยีสารสนเทศได้มีการพัฒนาระบบที่สามารถทำงานตามความต้องการและตอบสนองผู้รับบริการ ตรงตามความต้องการของโรงพยาบาลมากที่สุด 	ในปัจจุบัน งานเทคโนโลยีสารสนเทศได้มีการวางแผนและออกแบบระบบ ให้เหมาะสมกับความต้องการของผู้ใช้ มีการจัดตั้งคณะกรรมการพัฒนาระบบสารสนเทศ เพื่อให้มีส่วนร่วมในการออกแบบระบบ เชื่อมโยงสารสนเทศในโรงพยาบาลให้สามารถใช้ข้อมูลร่วมกัน และการกระจายข้อมูลสารสนเทศอย่างมีประสิทธิภาพ มีการพัฒนาซอฟท์แวร์เพื่อใช้งานภายในโรงพยาบาล รับผิดชอบดูแลระบบเครือข่ายคอมพิวเตอร์ การดูแลบำรุงรักษาระบบ การซ่อมบำรุงระบบคอมพิวเตอร์ การบริหารจัดการระบบข้อมูล รวมทั้งการฝึกสอนเจ้าหน้าที่ภายในและภายนอก โรงพยาบาล โดยดำเนินการดังนี้ •	สำรวจความต้องการใช้ข้อมูลสารสนเทศแก่เจ้าหน้าที่ทุกระดับในโรงพยาบาล');
INSERT INTO `knowledge` VALUES (8, 'หหหหหหหหหหหหหหหหหหหหหหหหหหหหหหห', 'ทีมสารสนเทศ 1. พญ.หริยา  รัตนสกล 		นายแพทย์ปฏิบัติการ  			ประธานกรรมการ 2. นายไชยกาญจน์  วิเชียรธนเมธา เจ้าพนักงานเครื่องคอมพิวเตอร์ 		กรรมการ 3. นายนิรุตติ์  เพียกุณา 		เจ้าพนักงานเครื่องคอมพิวเตอร์		กรรมการ 4.นายเชน  อภิชัยคุณาพล 	นักวิชาการสาธารณสุข	  		กรรมการและเลขานุการ 5.นางสาวมัณฑนี  ราชพิบูลย์	นักวิชาการสาธารณสุข			กรรมการและผู้ช่วยฯ  บทบาทหน้าที่ 1. จัดทำเผยแพร่ข้อมูลโรงพยาบาล 2. ดูแลระบบ LAN ของโรงพยาบาล จัดทำข้อมูลสำรอง 3. จัดทำเอกสารประชาใมพันธ์ความรู้ต่าง ๆ ตามฤดูกาลและให้บริการข้อมูลข่าวสารสุขภาพ 4. จัดเวทีเสนอนวัตกรรมกระบวนการพัฒนาคุณภาพรามถึงกระบวนการส่งเสริมสุขภาพ 5. ดูแลเกี่ยวกับการบันทึกเวชระเบียน ตรวจสอบความสมบูรณ์ของเวชระเบียน 6. จัดอบรมเจ้าหน้าที่เกี่ยวกับการใช้คอมพิวเตอร์');

-- ----------------------------
-- Table structure for migration
-- ----------------------------
DROP TABLE IF EXISTS `migration`;
CREATE TABLE `migration`  (
  `version` varchar(180) CHARACTER SET utf8 COLLATE utf8_thai_520_w2 NOT NULL,
  `apply_time` int(11) NULL DEFAULT NULL,
  PRIMARY KEY (`version`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_thai_520_w2 ROW_FORMAT = Compact;

-- ----------------------------
-- Records of migration
-- ----------------------------
INSERT INTO `migration` VALUES ('m000000_000000_base', 1541153323);
INSERT INTO `migration` VALUES ('m130524_201442_init', 1541153325);

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user`  (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `auth_key` varchar(32) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `password_hash` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `password_reset_token` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NULL DEFAULT NULL,
  `email` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `status` smallint(6) NOT NULL DEFAULT 10,
  `created_at` int(11) NOT NULL,
  `updated_at` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `username`(`username`) USING BTREE,
  UNIQUE INDEX `email`(`email`) USING BTREE,
  UNIQUE INDEX `password_reset_token`(`password_reset_token`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 3 CHARACTER SET = utf8 COLLATE = utf8_unicode_ci ROW_FORMAT = Compact;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES (1, 'chean', '5GlaBNNwdK8uI1Zuk_tQMAWYt_ViQeQs', '$2y$13$d7LoszlP1K0Exre4MYW7q.GPFSA3J5PjSP1VzCucYNjTKxSiRDJ7y', NULL, 'cheanpooh@gmail.com', 10, 1541319118, 1541319118);
INSERT INTO `user` VALUES (2, 'nitrut', 'AfNbv7zD5_TOVpDMvrUBgsz2kwxd26kj', '$2y$13$g0TdPn1qEYrNAxffLyHbse9s6gZ.55LFaoXQObNoQjeksW8JKDt8S', NULL, 'nirut@gmail.com', 10, 1541319215, 1541319215);

SET FOREIGN_KEY_CHECKS = 1;
